<!-- terraform-plan-aws_general-purpose-pr-4 -->
## 📝 Terraform Plan for `aws/general-purpose` (PR #4)

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ishiori-k8s-private-ecr"
      + region               = "ap-northeast-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_ecr_repository_policy.main will be created
  + resource "aws_ecr_repository_policy" "main" {
      + id          = (known after apply)
      + policy      = (known after apply)
      + region      = "ap-northeast-1"
      + registry_id = (known after apply)
      + repository  = "ishiori-k8s-private-ecr"
    }

  # aws_iam_instance_profile.ecr_instance_profile will be created
  + resource "aws_iam_instance_profile" "ecr_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ECRInstanceProfile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ECRFullAccessRole"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.ecr_full_access_policy will be created
  + resource "aws_iam_policy" "ecr_full_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy that provides full access to ECR repositories"
      + id               = (known after apply)
      + name             = "ECRFullAccessPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:*",
                          + "ecr-public:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "sts:GetServiceBearerToken",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "sts:AWSServiceName" = "codeartifact.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.ecr_full_access_role will be created
  + resource "aws_iam_role" "ecr_full_access_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                              + "codebuild.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ECRFullAccessRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecr_full_access_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecr_full_access_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ECRFullAccessRole"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ current_aws_caller_identity = {
      ~ arn_without_session = "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-16340809856" -> "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-16991358857"
        # (1 unchanged attribute hidden)
    }
```

</details>

*Workflow run: [`16991358857`](https://github.com/reverseon/ishiori-on-cloud/actions/runs/16991358857)*
